html/apue/basic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>基础知识</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="apue.html"> UP </a>
 |
 <a accesskey="H" href="apue.html"> HOME </a>
</div><div id="content">
<h1 class="title">基础知识</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">手册页</a>
<ul>
<li><a href="#sec-1-1">章节</a></li>
</ul>
</li>
<li><a href="#sec-2">系统调用与库函数</a></li>
<li><a href="#sec-3">文件和目录</a></li>
<li><a href="#sec-4">输入和输出</a></li>
<li><a href="#sec-5">程序与进程</a></li>
<li><a href="#sec-6">程序线程</a></li>
<li><a href="#sec-7">异步、并发、通信</a></li>
<li><a href="#sec-8">出错处理</a></li>
<li><a href="#sec-9">用户和用户标识</a>
<ul>
<li><a href="#sec-9-1">用户</a></li>
<li><a href="#sec-9-2">组</a></li>
</ul>
</li>
<li><a href="#sec-10">信号</a>
<ul>
<li><a href="#sec-10-1">信号处理</a></li>
</ul>
</li>
<li><a href="#sec-11">系统时间</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">手册页</h2>
<div class="outline-text-2" id="text-1">
<p>
Unix 参考手册页是进行系统编程必备的参考工具。它通常通过 man 命令直接联机阅读。手册页通常分为 9 节。采用“名称(章节号)”的方式来描述 Unix 术语时，表示此名称同时也是联机手册对应章节号下的一个条目
</p>
<div class="org-src-container">

<pre class="src src-sh">$ man 2 fork <span style="color: #ff4500;">#</span><span style="color: #ff4500;">&#26597;&#30475;&#31995;&#32479;&#35843;&#29992;&#24211;&#20989;&#25968;fork</span>
</pre>
</div>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">章节</h3>
<div class="outline-text-3" id="text-1-1">
<p>
以 Linux 为例，参考手册页各节内容如下:
</p>
<ol class="org-ol">
<li>系统命令手册：如 cp(1)
</li>
<li>系统调用手册：如 read(2)
</li>
<li>库函数手册：如 malloc(3)
</li>
<li>系统特殊文件手册：如 tty(4)
</li>
<li>标准的系统资源文件(全局配置文件)手册：如 services(5)
</li>
<li>游戏程序手册，包括屏保等各种图形化娱乐工具：如 glmatrix(6)
</li>
<li>杂类手册，包括各类头文件和宏：如 socket.h(7)
</li>
<li>系统管理工具：如 useradd(8)
</li>
<li>内核例程
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">系统调用与库函数</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>系统调用：提供了用户程序访问内核的接口，用户程序通过执行系统调用间接的获取内核所管理资源的访问权。执行系统调用时，程序控制权交给内核，内核在进程上下文中运行
</li>
<li>库函数：通过包含相应的.h 头文件引用，用户程序可以通过调用操作系统提供的库函数间接进行系统调用。如 printf(3)库函数，它除了管理缓冲区和格式化文本之外，执行了 write 系统调用访问文件。库函数也可以由其它程序提供，例如 GTK 库等。用户也可以自己重新实现库函数接口以替代所提供的库函数功能
</li>
</ul>

<p>
系统调用实际上也以库函数的形式直接提供给用户程序，如 write(2)、fork(2)等。对用户程序来说，不必专门区别那些是库函数、哪些是系统调用接口
</p>

<p>
对于 x86 平台的 Linux　可以通过/usr/include/asm/unistd<sub>32</sub>.h 查看其系统调用的接口
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">文件和目录</h2>
<div class="outline-text-2" id="text-3">
<p>
Unix 系统将计算机中的大部分资源都抽象为文件的形式，这样就可以通过 open(2) ，read(2) ，write(2) 等函数去直接访问
</p>

<ul class="org-ul">
<li>文件系统的结构：Unix 系统采用树状结构，全局具有唯一的一个根目录，通过'/'访问，除交换分区外，其它文件系统均挂载在/或其子目录下作为子目录存在
</li>
<li>文件名：除字符'/'与'NUL'外，都可以作为 Unix 文件的文件名，但为访问方便起见，一般建议采用可打印字符作为文件名，尽量不要使用 shell 和其它正则表达式的扩展字符，如*、?等
</li>
<li>路径名：访问一个文件可使用绝对路径(以'/'开头)或者相对路径(不以'/'起头的均被认作相对路径)
</li>
<li>目录中的特殊文件'.'和'..'：'/'下的'.'和‘..’指向它自身。可以使用 shell 命令`ls ­ai｀验证这两个特殊文件的用法
</li>
<li>工作目录：每个进程都有一个当前工作目录(current working directory)，用途为解释相对路径
</li>
<li>起始目录(home directory)：用户登录后的初始目录，由文件/etc/passwd 指定
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">输入和输出</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>文件描述符(file descriptor)：用以标识引用一个打开的文件，文件描述符是进程的属性。进程不同值相同的文件描述符引用的可以是不同的文件
</li>
<li>标准输入、标准输出和标准出错：进程创建时自动打开的三个文件描述符，默认为 0、1、2，一般通过用宏 STDIN<sub>FILENO、STDOUT</sub><sub>FILENO、STDERR</sub><sub>FILENO</sub> 来引用
</li>
<li>不带缓冲的 I/O：标准系统调用 open(2) 、read(2) 、write(2) 、lseek(2) 、close(2) 不使用缓冲区，直接把输入/输出送到内核，书中称为“不带缓冲的 I/O”。这里的缓冲位于进程地址空间
</li>
<li>标准 I/O： C 函数库中的标准 I/O 函数(定义在 stdio.h(7))使用缓冲区进行输入/输出、以提高吞吐效率。编程时要注意 I/O 重定向及 fork(2) 导致复制地址空间等情况下标准 I/O 函数对缓冲区的使用情况
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">程序与进程</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>程序是一个静态的概念，指存放在存储介质上可被内核通过 exec(3)系统调用读入并执行其中指令的文件，可能是二进制也可能是文本形式。Unix 上的程序需要执行权限
</li>
<li>进程是执行中的程序，除了程序本身的代码文本、数据外，进程还包括其它自身拥有的资源，诸如进程 id(PID)、打开的文件、地址空间、未决信号集、控制线程等
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">程序线程</h2>
<div class="outline-text-2" id="text-6">
<p>
对一个用户进程，内核实际执行调度处理的是它的执行线程。一个进程可以拥有一个或多个执行线程，对进程来说这些线程是并发执行的。进程内的多个线程共享进程资源
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">异步、并发、通信</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>异步(Asynchronous)：对系统资源以不可预测的时间和顺序执行的操作。例如等待外部输入、监听 TCP 端口等都是异步操作。对于异步操作，需要设计阻塞等待或超时等机制(一般都是基于信号机制实现)
</li>
<li>并发(Concurrency)：多个并行的异步进程/线程同时在同一个资源上会合时，产生并发。这时由于各自的异步性，读写等 I/O 操作可能交错发生乱序，从而出现意外的结果。为使它们的操作被强制的顺序化，需要进行同步处理。同步处理属于广义上的通信的范畴，有多种同步方式，一般采用锁机制。同步处理还需要注意竞争条件出现的死锁。这是 Unix 系统编程中较为复杂、容易出现 bug 的地方
</li>
<li>通信(Communication)：通过某种机制，在不同实体间交换数据。对 Unix 编程来说发送/接收、通知/响应、输入/输出等都属于比较广义的通信的范畴。狭义点的说法就指数据的发送/接收。Unix编程的主要通信方式为进程间通信和线程通信。广义的进程间通信包括了信号、管道、IPC 对象、套接字。条件变量、取消等操作可以用作线程间的通信(通知)。建议性锁和全局变量也是一种通信机制。不同应用场合的通信使用不同的机制和做法
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">出错处理</h2>
<div class="outline-text-2" id="text-8">
<p>
Unix 系统一般通过设置全局变量 errno(3) 标识程序执行时发生的错误。在系统所提供的库函数中，除非再次发生错误，否则不会改动 errno 的值也不会将其清零。errno 可以通过下面两个函数转换为对应的错误消息字符串
</p>

<ul class="org-ul">
<li>指定的 errno 错误号转换为字符串并返回这个字符串的指针
</li>
</ul>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;string.h&gt;</span>
<span style="color: #98fb98;">char</span> *<span style="color: #87cefa;">strerror</span>(<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">errnum</span>);
</pre>
</div>
<ul class="org-ul">
<li>执行一个格式化输出，指定的字符串以及当前的 errno 值对应的字符串
<div class="org-src-container">

<pre class="src src-C"><span style="color: #7fffd4;">#include</span> <span style="color: #ffa07a;">&lt;stdio.h&gt;</span>
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">perror</span>(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span> *<span style="color: #eedd82;">msg</span>);
</pre>
</div>
</li>
</ul>
<p>
相当于
</p>
<div class="org-src-container">

<pre class="src src-C">printf (<span style="color: #ffa07a;">"%s: %s"</span>, msg, strerror(errno));
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">用户和用户标识</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1">用户</h3>
<div class="outline-text-3" id="text-9-1">
<p>
正常下，UID 唯一标识了一个用户
</p>
<ul class="org-ul">
<li>系统的用户信息定义在/etc/passwd(passwd(5))
</li>
<li>用户的创建、修改、删除通常由系统管理员通过 useradd(1)、userdel(1)、usermod(1)等系统命令执行，而不应直接修改/etc/passwd 文件
</li>
<li>超级用户(root)的 UID 为 0
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2">组</h3>
<div class="outline-text-3" id="text-9-2">
<p>
组(group)将一个或多个用户组织起来，以使它们能以指定的相同权限访问资源。正常下，GID 唯一标识了一个组
</p>
<ul class="org-ul">
<li>GID 定义在/etc/group(group(5))
</li>
<li>组的创建、修改、删除通常由系统管理员通过 groupadd(1)、groupdel(1)、groupmod(1)等系统命令执行，而不应直接修改/etc/group 文件
</li>
<li>用户可以同时加入多个组，命令 groups(1) 可以打印出用户所在的组，第一个以外的均为附加组
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">信号</h2>
<div class="outline-text-2" id="text-10">
<p>
信号是软件中断机制，作为系统某种事件发生的通知
</p>
<ul class="org-ul">
<li>进程可以通过调用信号函数，在信号递送到进程时选择对其的处理方式
</li>

<li>进程还可以选择在信号递送之前屏蔽之，使之成为未决信号而延后处理
</li>

<li>进程捕捉到信号时将被中断，直到信号处理函数返回时方恢复执行
</li>
</ul>
</div>

<div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1">信号处理</h3>
<div class="outline-text-3" id="text-10-1">
<ol class="org-ol">
<li>忽略(丢弃)
</li>
<li>按系统的默认方式处理
</li>
<li>使用自定义信号捕捉函数来处理
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">系统时间</h2>
<div class="outline-text-2" id="text-11">
<p>
Unix系统使用两种方式标识时间
</p>
<ol class="org-ol">
<li>日历时间：指自 UTC 时间 1970 年 1 月 1 日 00:00:00 以来流逝的秒数，这个时间以 time<sub>t</sub> 类型保存。这是一个 32 位整型数。在 2038 年 1 月 18 日将发生溢出错误。例如，在 Unix 系统上无法创建一个时间为 2038 年 1 月以后的文件(touch ­t 命令)
</li>
<li>进程时间：用以衡量进程资源耗时情况，包括实际时钟时间(real time，为一个进程执行开始至今的全部时间)、用户 CPU 时间(user time，为程序在用户地址空间中执行的时间)、系统 CPU 时间(system time，为程序执行系统调用后在内核空间中执行的时间)。另外如果进程执行了 sleep(3) 等调用，睡眠的时间不计算为 CPU 时间，但计入实际时钟时间
</li>
</ol>

<p>
<a href="standard.html">Next：标准和实现</a>
</p>

<p>
<a href="apue.html">Home：目录</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

     <br/>
     <!-- DISQUS  -->
     <div id="disqus_thread"></div>
     <script type="text/javascript">
         /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
         var disqus_shortname = 'klose911-github-io.disqus'; // required: replace example with your forum shortname

         /* * * DON'T EDIT BELOW THIS LINE * * */
         (function() {
             var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
             dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
             (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
         })();
     </script>
     <noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
     <a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
  ga('create', 'UA-90850421-1', 'auto');
  ga('send', 'pageview');
</script>
</div>
</body>
</html>
